[/Script/GameProjectGeneration.TemplateProjectDefs]

Categories=Games

LocalizedDisplayNames=(Language="en",Text="Third Person")
LocalizedDescriptions=(Language="en",Text="This template features a playable character where the camera observes an over-the-shoulder point of view. The player can rotate the camera and move around using keyboard, mouse, controller or virtual joystick on a touch device. You can select a genre-specific starting point from the Variants drop-down. The C++ version includes code and content for all variants.")

LocalizedDisplayNames=(Language="ko",Text="3인칭")
LocalizedDescriptions=(Language="ko",Text="이 템플릿은 카메라가 어깨 너머 시점으로 관찰하는 플레이 가능한 캐릭터를 제공합니다. 플레이어는 키보드, 마우스, 컨트롤러 또는 터치 디바이스의 가상 조이스틱을 사용하여 카메라를 회전하고 이동할 수 있습니다. 배리언트 드롭다운에서 장르에 맞게 시작할 옵션을 선택할 수 있습니다. C++ 버전에는 모든 배리언트에 대한 코드와 콘텐츠가 포함되어 있습니다.")

LocalizedDisplayNames=(Language="ja",Text="三人称")
LocalizedDescriptions=(Language="ja",Text="このテンプレートには、カメラが肩越しの視点で表示されるプレイアブル キャラクターが含まれています。プレイヤーは、キーボード、マウス、コントローラー、またはタッチ デバイスのバーチャル ジョイスティックを使用して、カメラを回転させたり移動したりできます。[バリアント] ドロップダウンからジャンル固有の開始点を選択できます。C++ バージョンには、すべてのバリアントのコードとコンテンツが含まれています")

LocalizedDisplayNames=(Language="zh-Hans",Text="第三人称模板")
LocalizedDescriptions=(Language="zh-Hans",Text="此模板包含一个可操控的角色，镜头采用过肩视角进行拍摄。玩家可以通过键盘、鼠标、手柄或触控设备上的虚拟摇杆来旋转镜头并进行移动。你可以从“变体（Variants）”下拉菜单中选择特定游戏类型的起始点。C++版本包含了所有变体的代码和内容。")

; This project uses a thumbnail as the project icon
bThumbnailAsIcon=true

ClassTypes=Character, SpringArmComponent, PlayerController, GameMode
AssetTypes=Animation Sequence, Animation Blueprint, Skeleton, Skeletal Mesh, Control Rig

FoldersToIgnore=Binaries
FoldersToIgnore=Build
FoldersToIgnore=Intermediate
FoldersToIgnore=Saved
FoldersToIgnore=Media

FilesToIgnore="%TEMPLATENAME%.uproject"
FilesToIgnore="%TEMPLATENAME%.png"
FilesToIgnore="Config/TemplateDefs.ini"
FilesToIgnore="Config/config.ini"
FilesToIgnore="Manifest.json"
FilesToIgnore="contents.txt"


FolderRenames=(From="Source/%TEMPLATENAME%",To="Source/%PROJECTNAME%")
FolderRenames=(From="Source/%TEMPLATENAME%Editor",To="Source/%PROJECTNAME%Editor")

FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)

ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)
SharedContentPacks=(MountName="LevelPrototyping",DetailLevels=("High"))
SharedContentPacks=(MountName="Characters",DetailLevels=("High"))
SharedContentPacks=(MountName="Input",DetailLevels=("High"))
EditDetailLevelPreference="High"

; Variant packs
; NOTE: make sure these are commented out for release!
;SharedContentPacks=(MountName="Variant_Combat",DetailLevels=("Standard"))
;SharedContentPacks=(MountName="Variant_Platforming",DetailLevels=("Standard"))
;SharedContentPacks=(MountName="Variant_SideScroller",DetailLevels=("Standard"))

; Variant definitions
Variants=(Name="Combat",LocalizedDisplayNames=((Language="en",Text="Combat"),(Language="ja",Text="戦闘"),(Language="ko",Text="전투"),(Language="zh-Hans",Text="格斗游戏模板")),LocalizedDescriptions=((Language="en",Text="A combat game with melee attacks and AI-controlled enemies."),(Language="ja",Text="近接攻撃と AI 制御の敵が登場する戦闘ゲームです"),(Language="ko",Text="근접 공격과 AI로 제어되는 적을 상대하는 전투 게임입니다."),(Language="zh-Hans",Text="具有近战攻击功能和AI控制的敌人的格斗游戏。")),SharedContentPacks=((DetailLevels=(Standard),MountName="Variant_Combat")))

Variants=(Name="Platforming",LocalizedDisplayNames=((Language="en",Text="Platforming"),(Language="ja",Text="プラットフォーム"),(Language="ko",Text="플랫포머"),(Language="zh-Hans",Text="平台跳跃游戏模板")),LocalizedDescriptions=((Language="en",Text="A 3D platforming game with tweaked movement properties and advanced jump capabilities."),(Language="ja",Text="微調整された移動プロパティと高度なジャンプ機能を備えた 3D プラットフォーム ゲーム"),(Language="ko",Text="역동적인 무브먼트와 고급 점프 기능을 조정한 3D 플랫폼 게임입니다."),(Language="zh-Hans",Text="一款3D平台跳跃类游戏，其移动属性经过了调整，还具备先进的跳跃功能。")),SharedContentPacks=((DetailLevels=(Standard),MountName="Variant_Platforming")))

Variants=(Name="SideScroller",LocalizedDisplayNames=((Language="en",Text="Side Scroller"),(Language="ja",Text="横スクロール"),(Language="ko",Text="횡스크롤"),(Language="zh-Hans",Text="横版卷轴游戏模板")),LocalizedDescriptions=((Language="en",Text="A 2.5D platforming game with plane-constrained movement, advanced jump capabilities and a side-scrolling camera."),(Language="ja",Text="制約のある平面移動、高度なジャンプ機能、横スクロール カメラを備えた 2.5D プラットフォーム ゲーム"),(Language="ko",Text="평면으로 제한된 움직임, 고급 점프 기능, 횡스크롤 카메라를 갖춘 2.5D 플랫폼 게임입니다."),(Language="zh-Hans",Text="一款采用2.5D视角的平台跳跃游戏，具有受平面限制的移动方式、先进的跳跃功能以横向滚动的摄像机视角。")),SharedContentPacks=((DetailLevels=(Standard),MountName="Variant_SideScroller")))

Variants=(Name="All",LocalizedDisplayNames=((Language="en",Text="All"),(Language="ja",Text="All (全員)"),(Language="ko",Text="모두"),(Language="zh-Hans",Text="全部")),LocalizedDescriptions=((Language="en",Text="Includes all Third Person variants."),(Language="ja",Text="すべての三人称バリアントを含みます"),(Language="ko",Text="모든 3인칭 베리언트를 포함합니다."),(Language="zh-Hans",Text="包含全部第三人称模板变体。")),SharedContentPacks=((DetailLevels=(Standard),MountName="Variant_Combat"),(DetailLevels=(Standard),MountName="Variant_Platforming"),(DetailLevels=(Standard),MountName="Variant_SideScroller")))